#include <iostream>
using namespace std;

/*
    K칸을 점프하거나, 현재 온 거리 x2의 위치로 순간이동이 가능하다.
    순간이동을 하면 건전지를 쓰지 않으나, K칸을 이동하면 건전지를 K만큼 쓴다.
    최대한 점프로 이동하지 않으려 할 때, 사용해야 하는 건전지 사용량의 최솟값을 return하자.
    
    1. 목표값이 홀수라면, -1, /2를 수행한다
    2. 목표값이 짝수라면, 바로 /2를 수행한다.
    3. 목표값이 홀수인 경우에만 연료를 1씩 쓴다.
*/

int solution(int n)
{
    int ans = 0;    
    
    while (n > 0) {
        // 홀수라면, 1을 뺴고 2로 나눈다.
        if (n % 2 != 0) {
            n--;
            n /= 2;
            ans++;
        }
        
        // 짝수라면, 그냥 2로 나눈다.
        else {
            n /= 2;
        }
    }

    return ans;
}